RA5_DA3_50/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

s1
{
    type            scalarFixedValueConstraint;
    active          true;


    scalarFixedValueConstraintCoeffs
    {
	    selectionMode   cellZone;
    cellZone         porousZone;
        fieldValues
        {
            T              1;
        }
    }
}

// ************************************************************************* //
